Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/memtrad-tecnicasTA-usosTA.tmx
Source language: ca
Languages: es_es

source: Per exemple, la traducció mot per mot a l'anglés de la frase catalana Aquest exercici pràctic és molt senzill, amb \(m_1=Aquest\), \(m_2=exercici\), etc., podria ser This exercise practical it is very simple (incorrecta), on, per exemple, \(T(m_4)=T(és)=it is\).
es_es: Por ejemplo, la traducción palabra por palabra al inglés de la frase en español Este ejercicio práctico es muy sencillo, con \(p_1=Este\), \(p_2=ejercicio\), etc., podría ser This exercise practical it is very simple (incorrecta), donde, por ejemplo, \(T(p_4)=T(es)=it is\).

source: Per exemple, les dues frases angleses esmentades més amunt Sam gave a book to Leslie i Sam gave Leslie a book tenen una sintaxi diferent però volen dir exactament el mateix: Sam va donar un llibre a Leslie; el que més compta és qui fa l'acció, quin objecte afecta i qui n'és el destinatari, però no l'ordre en què aquestes entitats apareixen en la frase en LO {arnold93j}.
es_es: Por ejemplo, las dos frases inglesas mencionadas más arriba Sam gave a book to Leslie y Sam gave Leslie a book tienen una sintaxis diferente, pero quieren decir exactamente lo mismo: Sam le dio un libro a Leslie; lo que más cuenta es quién hace la acción, a qué objeto afecta y quién es el destinatario, pero no el orden en el que estas entidades aparecen en la frase en LO {arnold93j}.

source: Per exemple, per a produir traduccions acceptables, ràpides i intel·ligibles, fins i tot entre llengües molt semblants, s'ha d'afegir un processament lèxic robust (per exemple, per a tractar expressions multimot o per a elegir equivalents adequats per a mots lèxicament ambigus) i un processament estructural local o global que es basa en regles simples i ben formulades per a algunes transformacions estructurals (reordenaments, concordança, etc.).
es_es: Por ejemplo, para producir traducciones aceptables, rápidas e inteligibles, incluso entre lenguas muy parecidas, se tiene que añadir un procesamiento léxico robusto (por ejemplo, para tratar expresiones multipalabra o para elegir equivalentes adecuados para palabras léxicamente ambiguas) y un procesamiento estructural local o global que se basa en reglas simples y muy formuladas para algunas transformaciones estructurales (reordenamientos, concordancia, etc.).

source: Per exemple, podria convenir que les frases angleses ``Sam gave a book to Leslie'' i ``Sam gave Leslie a book'' {arnold93j} tingueren la mateixa RATO.
es_es: Por ejemplo, podría convenir que las frases inglesas ``Sam gave a book to Leslie'' y ``Sam gave Leslie a book'' {arnold93j} tuvieran la misma RATO.

source: Per exemple, si hem construït un sistema de transferència que tradueix de l'anglés a l'espanyol: {0.5cm}{en} $$ {{0.5cm}{A\(_{en}\)}} $$ {{1.125cm}{T\(_{en es}\)}} $$ {{0.5cm}{G\(_{es}\)}} $$ {0.5cm}{es} podem aprofitar el mòdul d'anàlisi de l'anglés (A\(_{en}\)) per a construir un sistema de l'anglés al català: {0.5cm}{en} $$ {{0.5cm}{A\(_{en}\)}} $$ {{1.125cm}{T\(_{en ca}\)}} $$ {{0.5cm}{G\(_{ca}\)}} $$ {0.5cm}{ca} o usar el mòdul de generació de l'espanyol G\(_{es}\) per a construir un sistema del neerlandés a l'espanyol: {0.5cm}{en} $$ {{0.5cm}{A\(_{nl}\)}} $$ {{1.125cm}{T\(_{nl es}\)}} $$ {{0.5cm}{G\(_{es}\)}} $$ {0.5cm}{es} [Reversibilitat parcial.] Si se separen les dades lingüístiques usades per cada un dels tres mòduls, és possible una reversibilitat parcial.
es_es: Por ejemplo, si hemos construido un sistema de transferencia que traduce de inglés a español: {0.5cm}{en} $$ {{0.5cm}{A\(_{en}\)}} $$ {{1.125cm}{T\(_{en es}\)}} $$ {{0.5cm}{G\(_{es}\)}} $$ {0.5cm}{es} pueden aprovechar el módulo de análisis de inglés (A\(_{en}\)) para construir un sistema de inglés a catalán: {0.5cm}{en} $$ {{0.5cm}{A\(_{en}\)}} $$ {{1.125cm}{T\(_{en ca}\)}} $$ {{0.5cm}{G\(_{ca}\)}} $$ {0.5cm}{ca} o usar el módulo de generación del español G\(_{es}\) para construir un sistema del neerlandés al español: {0.5cm}{en} $$ {{0.5cm}{A\(_{nl}\)}} $$ {{1.125cm}{T\(_{nl es}\)}} $$ {{0.5cm}{G\(_{es}\)}} $$ {0.5cm}{es} [Reversibilidad parcial.] Si se separan los datos lingüísticos usados por cada uno de los tres módulos, es posible una reversibilidad parcial.

source: Per exemple, si la frase té \(N\) mots, m_1 m_2 m_3 m_N la traducció mot per mot és T(m_1) T(m_2) T(m_3) T(m_N) on \(T(m)\) representa l'equivalent fix del mot \(m\) en la LM, que pot tenir zero, un o més mots.
es_es: Por ejemplo, si la frase tiene \(N\) palabras, p_1 p_2 p_3 p_N la traducción palabra por palabra es T(p_1) T(p_2) T(p_3) T(p_N) donde \(T(p)\) representa el equivalente fijo de la palabra \(p\) en la lengua meta LM, que puede tener cero, una o más palabras.

source: Per exemple, si sabem que el substantiu anglés ski es tradueix per esquí i que la locució substantiva ski station es tradueix per estació d'esquí podem generalitzar aquesta última locució substituint ski per qualsevol altres substantiu $N$, de manera que la traducció de ``$N$ station'' és ``estació de $N$''; així, si la traducció de train és tren, la traducció de train station és estació de tren, etc.
es_es: Por ejemplo, si sabemos que el sustantivo inglés ski se traduce por esquí y que la locución sustantiva ski station se traduce por estació d'esquí podemos generalizar esta última locución sustituyendo ski por cualquier otros sustantivo $N$, de forma que la traducción de ``$N$ station'' es ``estació de $N$''; así, si la traducción de train es tren, la traducción de train station es estació de tren, etc.

source: Per exemple, si usem el patró substantiu--adjectiu per a identificar una classe de sintagmes nominals senzills, podem fer que la traducció correcta al català del sintagma nominal espanyol { postre buenísimo} siga postres boníssimes, ja que el gènere i el nombre de l'adjectiu que modifica a un substantiu ha de concordar-hi i el substantiu espanyol postre (masculí singular) es correspon amb el substantiu català postres (femení plural).
es_es: Por ejemplo, si usamos el patrón sustantivo--adjetivo para identificar una clase de sintagmas nominales sencillos, podemos hacer que la traducción correcta al catalán del sintagma nominal español { postre buenísimo} sea postres boníssimes, puesto que el género y el número del adjetivo que modifica a un sustantivo tiene que concordar y el sustantivo español postre (masculino singular) se corresponde con el sustantivo catalán postres (femenino plural).

source: Per exemple, un text pot ser intel·ligible encara que no concorden els adjectius amb els noms o fins i tot encara que se n'hagen eliminat els articles (A amic meu li agraden xiques vell), o l'ordre dels mots no siga gramatical (La guerra evitar no podrem).
es_es: Por ejemplo, un texto puede ser inteligible aunque no concuerden los adjetivos con los nombres o incluso aunque se hayan eliminado los artículos (A amic meu li agraden xiques vell), o el orden de las palabras no sea gramatical (La guerra evitar no podrem).

source: Per norma general, els sistemes de traducció automàtica tradueixen cadascuna de les oracions una per una sense tenir en compte la resta d'oracions del text a traduir.
es_es: Por norma general, los sistemas de traducción automática traducen cada una de las oraciones una por una sin tener en cuenta el resto de oraciones del texto a traducir.

source: Per poder dur a terme la traducció és necessari que els textos del corpus hagen estat alineats prèviament (mitjançant mètodes estadístics o mètodes basats en regles).
es_es: Para poder llevar a cabo la traducción es necesario que los textos del corpus hayan sido alineados previamente (mediante métodos estadísticos o métodos basados en reglas).

source: Per precisar millor què volem dir amb això d'``assistida per ordinador'', es fa necessari considerar les nocions de traducció humana assistida per una màquina (en anglés machine-aided human translation; MAHT), i traducció automàtica assistida per un humà (en anglés human-aided machine translation; HAMT), que estableixen les dues situacions bàsiques d'interacció entre una persona i un ordinador a l'hora de fer la traducció.
es_es: Para precisar mejor qué queremos decir con esto de ``asistida por ordenador'', es necesario considerar las nociones de traducción humana asistida por una máquina (en inglés machine-aided human translation; MAHT), y traducción automática asistida por un humano (en inglés human-aided machine translation; HAMT), que establecen las dos situaciones básicas de interacción entre una persona y un ordenador a la hora de hacer la traducción.

source: Per què pensar-hi si molt prompte es disposaria de sistemes perfectes?
es_es: ¿Por qué pensar en él si pronto se dispondría de sistemas perfectos?

source: Per què és necessària la preedició en els sistemes de traducció automàtica?
es_es: ¿Por qué es necesaria la preedición en los sistemas de traducción automática?

source: Per rudimentari que siga un sistema de traducció automàtica, pot ser molt útil en tasques d'assimilació.
es_es: Por rudimentario que sea un sistema de traducción automática, puede ser muy útil en tareas de asimiliación.

source: Per tal de minimitzar les modificacions a fer a la traducció automàtica, pot ser útil restringir la llengua d'origen (no permetre'n totes les realitzacions possibles, ni tot el lèxic, ni tots els registres) a un llenguatge que puga ser traduït automàticament amb el mínim possible de problemes, és a dir, amb el mínim esforç de postedició, o almenys, amb un esforç acceptable per un revisor. Açò és especialment important quan es tracta de traduir manuals tècnics a diversos idiomes.
es_es: Para minimizar las modificaciones a hacer en la traducción automática, puede ser útil restringir la lengua de origen (no permitir todas las realizaciones posibles, ni todo el léxico, ni todos los registros) a un lenguaje que pueda ser traducido automáticamente con el mínimo posible de problemas, es decir, con el mínimo esfuerzo de postedición, o al menos, con un esfuerzo aceptable por un revisor. Esto es especialmente importante cuando se trata de traducir manuales técnicos a varios idiomas.

source: Per tant, apareix quasi mil vegades més freqüentment que l'atzar.
es_es: Por lo tanto, aparece casi mil veces más frecuentemente que al azar.

source: Per tant, el sistema semiautomàtic costa només $($0,03$+$0,01$) n = $0,04$ n$ euros, davant dels 0,05$ n$ euros del traductor professional.
es_es: Por lo tanto, el sistema semiautomático cuesta sólo $($0,03$+$0,01$) n = $0,04$ n$ euros, ante los 0,05$ n$ euros del traductor profesional.

source: Per tant, el sistema semiautomàtic costa només 40 euros, davant dels 50 del traductor professional.
es_es: Por lo tanto, el sistema semiautomático cuesta sólo 40 euros, ante los 50 del traductor profesional.

source: Per tant, els sistemes amb anàlisis més avançades (transferència semàntica, interlingua) també l'apliquen.
es_es: Por lo tanto, los sistemas con análisis más avanzados (transferencia semántica, interlingua) también lo aplican.

source: Per tant, ha d'estar segur que el resultat és traducció del text original.
es_es: Por lo tanto, tiene que estar seguro de que el resultado es traducción del texto original.

source: Per tant, si es tradueix aquesta oració amb un sistema de traducció automàtica indirecta per transferència sintàctica{} {}el sistema es bloquejarà perquè només opera a nivell sintàctic {}l'ambigüitat lèxica no afecta el resultat perquè no afecta la sintaxi {}pot encara produir-se un error en la traducció per causa de l'ambigüitat lèxica de transferència
es_es: Por lo tanto, si se traduce esta oración con un sistema de traducción automática indirecta por transferencia sintáctica{} {}el sistema se bloqueará porque sólo opera a nivel sintáctico {}la ambigüedad léxica no afecta al resultado porque no afecta a la sintaxis {}puede todavía producirse un error en la traducción a causa de la ambigüedad léxica de transferencia

source: Per últim, cal deixar clar que l'ús d'un llenguatge controlat és una alternativa a la preedició dels textos, però que no elimina per complet la necessitat de postedició o, almenys, de revisió de les traduccions en brut.
es_es: Por último, hay que dejar claro que el uso de un lenguaje controlado es una alternativa a la preedición de los textos, pero que no elimina por completo la necesidad de postedición o, al menos, de revisión de las traducciones en bruto.

source: Per últim, el sistemes de traducció automàtica estadística (que es discutiran en l'apartat ) fan assumpcions d'independència estadística per poder modelar estadísticament el procés de traducció.
es_es: Por último, los sistemas de traducción automática estadística (que se discutirán en el apartado ) hacen asunciones de independencia estadística para poder modelar estadísticamente el proceso de traducción.

source: Perquè siga pràctic, l'algorisme d'anàlisi sintàctica ha de ser ràpid i eficient; per exemple, és convenient que funcione de manera que puga construir progressivament els arbres llegint l'oració d'esquerra a dreta, ja que així (a) pot començar a treballar abans que l'analitzador morfològic haja analitzat tota l'oració i (b) pot proveir el mòdul de transferència amb anàlisis parcials que li poden servir per a anar preparant la traducció parcial de les parts ja analitzades.
es_es: Para que sea práctico, el algoritmo de análisis sintáctico tiene que ser rápido y eficiente; por ejemplo, es conveniente que funcione de manera que pueda construir progresivamente los árboles leyendo la oración de izquierda a derecha, ya que así (a) puede comenzar a trabajar antes de que el analizador morfológico haya analizado toda la oración y (b) puede proveer el módulo de transferencia con análisis parciales que le pueden servir para ir preparando la traducción parcial de las partes ya analizadas.

source: Però abans de considerar l'automatització de la traducció i les seues aplicacions fóra bo que ens paràrem un poc per a discutir què vol dir exactament el mot traducció.
es_es: Pero antes de considerar la automatización de la traducción y sus aplicaciones sería mejor que nos parásemos un poco a discutir qué quiere decir exactamente la palabra traducción.

source: Però els sistemes de transferència sintàctica no apliquen exactament el principi de composicionalitat semàntica, ja que es basen en l'aproximació que es poden traduir separadament: d'una banda, els mots (transferència lèxica) substituint-los pels seus equivalents i, d'altra banda, els arbres, transformant-ne l'estructura.
es_es: Pero los sistemas de transferencia sintáctica no aplican exactamente el principio de composicionalidad semántica, ya que se basan en la aproximación de que se pueden traducir separadamente: por un lado, las palabras (transferencia léxica) sustituyéndolas por sus equivalentes y, por otro lado, los árboles, transformando la estructura.

source: Però hi ha mots que tendeixen a estar junts (col·locacions, unitats lèxiques multimot, unitats terminològiques) més que l'atzar.
es_es: Pero hay palabras que tienden a estar juntas (colocaciones, unidades léxicas multipalabra, unidades terminológicas) más que al azar.

source: Però les interlingües no han de ser necessàriament el resultat d'una anàlisi profunda: el que han de ser necessàriament és neutrals; per exemple, alguns sistemes històrics com DLT [cap. 17]{hutchins92b} usen com a interlingua una llengua pivot ``natural'' com l'esperanto, amb anotacions que resolen algunes ambigüitats típiques.
es_es: Pero las interlinguas no tienen que ser necesariamente el resultado de un análisis profundo: lo que tienen que ser necesariamente es neutrales; por ejemplo, algunos sistemas históricos como DLT [cap. 17]{hutchins92b} usan como interlingua una lengua pivot ``natural'' como el esperanto, con anotaciones que resuelven algunas ambigüedades típicas.

source: Però per a això, cal identificar quines paraules són adjectius i substantius: la fase d'anàlisi es pot encarregar d'aquesta tasca perquè la fase de transferència puga aplicar regles generals sense preocupar-se de quins són els adjectius o els substantius concrets.
es_es: Pero para eso, hay que identificar qué palabras son adjetivos y sustantivos: la fase de análisis se puede encargar de esta tarea para que la fase de transferencia pueda aplicar reglas generales sin preocuparse de cuáles son los adjetivos o los sustantivos concretos.

source: Però per produir bones traduccions no podem usar el model de traducció únicament perquè les traduccions serien poc naturals, gramaticals i fluides.
es_es: Pero para producir buenas traducciones no podemos usar el modelo de traducción únicamente porque las traducciones serían poco naturales, gramaticales y fluidas.

source: Però recentment (sobretot en els primers anys del tercer mil·lenni) s'està produint un creixement espectacular de tècniques inductives de traducció automàtica, en les quals el sistema aprén automàticament a traduir entre dues llengües a partir d'un corpus paral·lel suficientment gran d'oracions en LO acompanyades de la seua traducció a la LM (vegeu l'apartat ).
es_es: Pero recientemente (sobre todo en los primeros años del tercer milenio) se está produciendo un crecimiento espectacular de las técnicas inductivas de traducción automática, en las cuales el sistema aprende automáticamente a traducir entre dos lenguas a partir de un corpus paralelo suficientemente grande de oraciones en LO acompañadas de su traducción a la LM (véase el apartado ).

source: Podríeu explicar la causa d'aquesta variació?
es_es: ¿Podríais explicar la causa de esta variación?

source: Primerament, elegiu un idioma meta (francés, anglés o alemany) i un idioma origen (català o espanyol).
es_es: Primeramente, elegid un idioma meta (francés, inglés o alemán) y un idioma origen (catalán o español).

source: Primerament, s'han d'obtenir els alineaments entre els mots (vegeu-ne un exemple en la figura ) per a després estimar el model de traducció a partir d'aquests alineaments.
es_es: Primeramente, se tienen que obtener los alineamientos entre las palabras (véase un ejemplo en la figura ) para después estimar el modelo de traducción a partir de estos alineamientos.

source: Probablement ha dissenyat també un mòdul de preedició i el sistema elimina automàticament qualsevol causa d'ambigüitat.
es_es: Probablemente ha diseñado también un módulo de preedición y el sistema elimina automáticamente cualquier causa de ambigüedad.

source: Proposeu un conjunt de regles de reordenament que expliquen el conjunt de traduccions observat.
es_es: Proponed un conjunto de reglas de reordenamiento que explican el conjunto de traducciones observadas.

source: Pràcticament ningú va considerar com es podria traure profit d'un sistema imperfecte ---amb excepcions comptades: va estudiar la utilitat de la traducció mot per mot com a pidgin, és a dir, com a llengua de contacte, en comparació amb una traducció nativa.
es_es: Prácticamente nadie consideró cómo se podría sacar provecho a un sistema imperfecto: ---con excepciones contadas: se estudió la utilidad de la traducción palabra por palabra como pidgin, es decir, como lengua de contacto, en comparación con una traducción nativa.

source: Quan els programes de traducció automàtica i semiautomàtica han de tractar documents estructurats (com els discutits en els epígrafs i ) han de ser capaços d'identificar les parts dels documents que corresponen als textos que s'han de traduir, destriant-les de les etiquetes.
es_es: Cuando los programas de traducción automática y semiautomática han de tratar documentos estructurados (como los discutidos en los epígrafes y ) tienen que ser capaces de identificar las partes de los documentos que corresponden a los textos que se tienen que traducir, estriándolos de las etiquetas.

source: Quan en una situació hi ha més d'una acció possible ---circumstància que pot ser deguda, com en l'exemple, al fet que la gramàtica és ambigua--- es pot fer una d'aquestes dues coses: elegir sempre una acció fixa o bé ``duplicar'' l'analitzador de manera que cada còpia continue l'anàlisi per cada un dels camins.
es_es: Cuando en una situación hay más de una acción posible ---circunstancia que puede ser debida, como en el ejemplo, al hecho de que la gramática es ambigua--- se puede hacer una de estas dos cosas: elegir siempre una acción fija o bien ``duplicar'' el analizador de forma que cada copia continúe el análisis por cada uno de los caminos.

source: Quan es tradueix entre llengües emparentades, com per exemple de l'espanyol al català, poques vegades es donen situacions com aquesta, ja que, en general, l'ordre dels mots no sol canviar tan radicalment; una construcció espanyola que sí que podria requerir la identificació i el desplaçament d'un sintagma nominal complet per a traduir-lo al català seria la construcció de relatiu possessiu amb cuyo, ja que el català no en té.
es_es: Cuando se traduce entre lenguas emparentadas, como por ejemplo del español al catalán, pocas veces se dan situaciones como esta, ya que, en general, el orden de las palabras no suele cambiar tan radicalmente; una construcción española que sí que podría requerir la identificación y el desplazamiento de un sintagma nominal completo para traducirlo al catalán sería la construcción de relativo posesivo con cuyo, ya que el catalán no tiene.

source: Quan la situació a la qual s'arriba no està prevista en la taula, és perquè l'oració no és correcta d'acord amb la gramàtica donada; aquesta situació d'error s'ha de resoldre de manera que l'anàlisi puga continuar, encara que el resultat siga una anàlisi parcial, ja que ens interessa produir una traducció aproximada; el tractament de les situacions d'error és complex i cau fora de l'abast d'aquest llibre.
es_es: Cuando la situación a la cual se llega no está prevista en la tabla, es porque la oración no es correcta de acuerdo con la gramática dada; esta situación de error se tiene que resolver de forma que el análisis pueda continuar, aunque el resultado sea un análisis parcial, puesto que nos interesa producir una traducción aproximada; el tratamiento de las situaciones de error es complejo y está fuera del alcance de este libro.

source: Quan posteditem un text trobem una paraula que el traductor automàtic no ha sabut traduir, i ens l'ofereix en la llengua origen.
es_es: Cuando posteditamos un texto encontramos una palabra que el traductor automático no ha sabido traducir y nos lo ofrece en la lengua origen.

source: Quan s'usen per a la traducció, els llenguatges controlats restringeixen directament{} {} la llengua meta.
es_es: Cuando se usan para la traducción, los lenguajes controlados restringen directamente{} {} la lengua meta.

source: Quan tenim més d'una regla, no sabem en quin ordre cal aplicar-les-hi.
es_es: Cuando tenemos más de una regla, no sabemos en qué orden hay que aplicarlas.

source: Quantes llengües naturals ha de conéixer l'equip d'experts que ha d'incorporar una nova llengua a un sistema de traducció automàtica basat en interlingua que ja en té 7?
es_es: ¿Cuántas lenguas naturales tiene que conocer el equipo de expertos que tiene que incorporar una nueva lengua a un sistema de traducción automática basado en interlingua que ya tiene 7?

source: Quants mòduls d'anàlisi i de generació hem d'afegir en total a un sistema basat en transferència que ara mateix permet traduir entre 4 llengües, si volem incorporar-hi una llengua més de manera que el sistema puga traduir (tant en un sentit com en l'altre) entre totes les llengües existents i la nova?
es_es: ¿Cuántos módulos de análisis y de generación tenemos que añadir en total a un sistema basado en transferencia que ahora mismo permite traducir entre 4 lenguas, si queremos incorporar una lengua más para que el sistema pueda traducir (tanto en un sentido como en el otro) entre todas las lenguas existentes y la nueva?
